data_analysis/benchmark_lrdt/ycsb/20240519_153312/cluster-default/workload_99_1_mongo/960/100000/2/transactions_3.dat
/usr/bin/java  -classpath /home/ccamilleri-prest/YCSB/conf:/home/ccamilleri-prest/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/ccamilleri-prest/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/lrdt/workload_99_1 -p mongodb.url=mongodb+srv://app:Mu8PfKAF9g7mr9yE6wnT@cluster-cms-pot-01-pl-0.mubeh.mongodb.net/u_cmsdb?retryWrites=true&w=majority -threads 60 -p operationcount=10000000 -p fieldlength=100 -p fieldlengthdistribution=constant -p measurementtype=timeseries -p timeseries.granularity=100 -p readrecordcount=100000 -p updaterecordcount=100000
mongo client connection created with mongodb+srv://app:Mu8PfKAF9g7mr9yE6wnT@cluster-cms-pot-01-pl-0.mubeh.mongodb.net/u_cmsdb?retryWrites=true&w=majority
[OVERALL], RunTime(ms), 60228
[OVERALL], Throughput(ops/sec), 2662.9972770140134
[TOTAL_GCS_G1_Young_Generation], Count, 6
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 145
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.24075180978946667
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 145
[TOTAL_GC_TIME_%], Time(%), 0.24075180978946667
[READ], Operations, 158746
[READ], AverageLatency(us), 19868.149912438737
[READ], MinLatency(us), 198
[READ], MaxLatency(us), 1974882
[READ], Return=OK, 158749
[READ], 0, 430973.1987951807
[READ], 100, 34330.09137055837
[READ], 300, 219301.67289719626
[READ], 400, 124702.72972972973
[READ], 500, 20719.8722741433
[READ], 600, 18097.35714285714
[READ], 700, 7153.472832369942
[READ], 800, 9099.290880503144
[READ], 900, 19996.48
[READ], 1000, 26331.124031007752
[READ], 1100, 13888.20902090209
[READ], 1200, 6032.903543307087
[READ], 1400, 23301.703891708967
[READ], 1500, 6177.50459770115
[READ], 1600, 8258.317406143346
[READ], 1700, 9550.72619047619
[READ], 1800, 11667.55818540434
[READ], 1900, 9740.146141215107
[READ], 2000, 9885.514084507042
[READ], 2100, 7528.078003120125
[READ], 2200, 13604.490476190476
[READ], 2300, 11337.273255813954
[READ], 2400, 9636.070945945947
[READ], 2500, 9698.064417177915
[READ], 2600, 18004.428
[READ], 2700, 25487.279069767443
[READ], 2800, 15634.206266318537
[READ], 2900, 14857.351351351352
[READ], 3000, 22617.859848484848
[READ], 3100, 16978.480446927373
[READ], 3200, 20280.011406844107
[READ], 3300, 19654.800632911392
[READ], 3400, 19685.508960573476
[READ], 3500, 20019.44074074074
[READ], 3600, 27219.542222222222
[READ], 3700, 22948.432314410482
[READ], 3800, 17472.98222222222
[READ], 3900, 23985.429864253394
[READ], 4000, 35510.951515151515
[READ], 4100, 40113.934426229505
[READ], 4200, 38545.69696969697
[READ], 4300, 45933.62111801242
[READ], 4400, 27824.729166666668
[READ], 4500, 46017.20547945205
[READ], 4600, 32299.87373737374
[READ], 4700, 24317.869918699187
[READ], 4800, 22773.85593220339
[READ], 4900, 18608.149152542373
[READ], 5000, 16893.62671232877
[READ], 5100, 21905.293172690763
[READ], 5200, 24173.9359430605
[READ], 5300, 25006.36752136752
[READ], 5400, 23089.782101167315
[READ], 5500, 21137.826241134753
[READ], 5600, 20543.822916666668
[READ], 5700, 21308.256603773585
[READ], 5800, 21668.03370786517
[READ], 5900, 19716.176470588234
[READ], 6000, 13522.909448818898
[READ], 6100, 12457.994818652849
[READ], 6200, 10122.9
[READ], 6300, 9688.349282296651
[READ], 6400, 22996.310185185186
[READ], 6500, 12441.55
[READ], 6600, 7905.746666666667
[READ], 6700, 27216.322175732217
[READ], 6800, 53968.45086705202
[READ], 6900, 21685.24817518248
[READ], 7000, 12929.696369636964
[READ], 7100, 19381.88679245283
[READ], 7200, 17915.97142857143
[READ], 7300, 22567.87037037037
[READ], 7400, 20407.263513513513
[READ], 7500, 21593.354581673306
[READ], 7600, 16818.234806629833
[READ], 7700, 10237.920930232558
[READ], 7800, 17799.244
[READ], 7900, 15149.39574468085
[READ], 8000, 17878.138181818184
[READ], 8100, 20799.36176470588
[READ], 8200, 43369.59459459459
[READ], 8300, 14710.844660194174
[READ], 8400, 10853.370517928286
[READ], 8500, 10746.367003367004
[READ], 8600, 28695.5117370892
[READ], 8700, 14202.735483870967
[READ], 8800, 16785.204301075268
[READ], 8900, 37445.50777202073
[READ], 9000, 38144.44086021505
[READ], 9100, 37705.18556701031
[READ], 9200, 29990.212927756653
[READ], 9300, 18942.522633744855
[READ], 9400, 21914.55737704918
[READ], 9500, 22904.06613226453
[READ], 9600, 8684.46590909091
[READ], 9700, 10119.89605734767
[READ], 9800, 17618.72596153846
[READ], 9900, 28825.385159010602
[READ], 10000, 14265.036900369003
[READ], 10100, 31869.30291970803
[READ], 10200, 18016.06761565836
[READ], 10300, 22504.421245421247
[READ], 10400, 20533.910714285714
[READ], 10500, 21320.32342007435
[READ], 10600, 22251.46992481203
[READ], 10700, 16400.930147058825
[READ], 10800, 25131.236749116608
[READ], 10900, 9924.147928994083
[READ], 11000, 14696.767857142857
[READ], 11100, 12286.138095238095
[READ], 11200, 10061.766816143498
[READ], 11300, 61014.5938697318
[READ], 11400, 5338.452777777778
[READ], 11500, 24861.035928143712
[READ], 11600, 25567.07207207207
[READ], 11700, 21686.248062015504
[READ], 11800, 21341.147601476016
[READ], 11900, 21814.624561403507
[READ], 12000, 21310.470802919706
[READ], 12100, 19903.967611336033
[READ], 12200, 22239.027491408935
[READ], 12300, 15108.60153256705
[READ], 12400, 10456.634146341463
[READ], 12500, 12550.524193548386
[READ], 12600, 30393.23
[READ], 12700, 10672.375314861461
[READ], 12800, 19711.316455696204
[READ], 12900, 41480.30256410257
[READ], 13000, 34074.31923076923
[READ], 13100, 14281.00668896321
[READ], 13200, 22466.732352941177
[READ], 13300, 27953.427184466018
[READ], 13400, 24463.691275167785
[READ], 13500, 20889.63003663004
[READ], 13600, 19870.239819004524
[READ], 13700, 11687.197368421053
[READ], 13800, 31776.044534412955
[READ], 13900, 16922.643790849674
[READ], 14000, 20632.006944444445
[READ], 14100, 16003.728301886793
[READ], 14200, 17212.578378378377
[READ], 14300, 23782.108108108107
[READ], 14400, 18742.00374531835
[READ], 14500, 19453.926829268294
[READ], 14600, 24419.820083682007
[READ], 14700, 6680.1121076233185
[READ], 14800, 38221.73895582329
[READ], 14900, 19246.24701195219
[READ], 15000, 17888.258992805757
[READ], 15100, 16586.44625407166
[READ], 15200, 8429.328125
[READ], 15300, 35293.51063829787
[READ], 15400, 27728.273356401383
[READ], 15500, 16095.012711864407
[READ], 15600, 18854.143396226416
[READ], 15700, 9593.922848664688
[READ], 15800, 28307.754032258064
[READ], 15900, 21095.413284132843
[READ], 16000, 22802.45914396887
[READ], 16100, 21174.562231759657
[READ], 16200, 21922.752613240416
[READ], 16300, 20516.192
[READ], 16400, 19025.675862068965
[READ], 16500, 17958.52786885246
[READ], 16600, 28864.65876777251
[READ], 16700, 21722.30769230769
[READ], 16800, 22547.592057761733
[READ], 16900, 16176.917293233082
[READ], 17000, 14013.97212543554
[READ], 17100, 35613.120689655174
[READ], 17200, 21257.252747252747
[READ], 17300, 11667.873983739837
[READ], 17400, 24728.696696696697
[READ], 17500, 18512.70588235294
[READ], 17600, 6793.714285714285
[READ], 17700, 23706.10138248848
[READ], 17800, 23601.723502304147
[READ], 17900, 23879.4
[READ], 18000, 21240.335616438355
[READ], 18100, 21750.706896551725
[READ], 18200, 25864.639423076922
[READ], 18300, 16866.040268456374
[READ], 18400, 18231.275862068964
[READ], 18500, 28260.003937007874
[READ], 18600, 23427.469314079422
[READ], 18700, 16626.3082437276
[READ], 18800, 10538.481690140845
[READ], 18900, 18465.538681948423
[READ], 19000, 22635.46902654867
[READ], 19100, 13491.10248447205
[READ], 19200, 31890.242857142857
[READ], 19300, 23638.432835820895
[READ], 19400, 21283.43621399177
[READ], 19500, 18434.26712328767
[READ], 19600, 27537.85520361991
[READ], 19700, 7366.184210526316
[READ], 19800, 14805.034965034965
[READ], 19900, 36009.839590443684
[READ], 20000, 18511.932806324112
[READ], 20100, 24165.498293515357
[READ], 20200, 21091.69318181818
[READ], 20300, 21593.54365079365
[READ], 20400, 22322.89270386266
[READ], 20500, 20171.085714285713
[READ], 20600, 21650.856666666667
[READ], 20700, 16364.39393939394
[READ], 20800, 8604.121951219513
[READ], 20900, 11489.128888888888
[READ], 21000, 9403.681647940075
[READ], 21100, 22696.66826923077
[READ], 21200, 13862.394736842105
[READ], 21300, 48117.02745098039
[READ], 21400, 47530.66798418972
[READ], 21500, 19120.126050420167
[READ], 21600, 18968.505836575874
[READ], 21700, 15742.54054054054
[READ], 21800, 27318.174603174604
[READ], 21900, 16998.9683908046
[READ], 22000, 20565.45703125
[READ], 22100, 10650.09649122807
[READ], 22200, 24494.0
[READ], 22300, 21622.787313432837
[READ], 22400, 22529.452205882353
[READ], 22500, 21104.413284132843
[READ], 22600, 21424.570342205323
[READ], 22700, 10013.980158730159
[READ], 22800, 13455.233766233767
[READ], 22900, 11405.738993710691
[READ], 23000, 44383.18376068376
[READ], 23100, 26435.259842519685
[READ], 23200, 21532.83582089552
[READ], 23300, 18606.779310344828
[READ], 23400, 17167.203636363636
[READ], 23500, 16067.96644295302
[READ], 23600, 11013.63605442177
[READ], 23700, 14590.857142857143
[READ], 23800, 17759.01552795031
[READ], 23900, 42376.73529411765
[READ], 24000, 21033.72084805654
[READ], 24100, 25535.542087542086
[READ], 24200, 18318.786324786324
[READ], 24300, 24423.637010676157
[READ], 24400, 23503.29147982063
[READ], 24500, 17047.753289473683
[READ], 24600, 13793.272151898735
[READ], 24700, 20852.804347826088
[READ], 24800, 19185.333333333332
[READ], 24900, 14792.71914893617
[READ], 25000, 22478.531561461794
[READ], 25100, 12646.361386138615
[READ], 25200, 12614.211699164345
[READ], 25300, 30172.669934640522
[READ], 25400, 22257.980861244017
[READ], 25500, 19169.515463917527
[READ], 25600, 13494.807947019868
[READ], 25700, 17772.87106017192
[READ], 25800, 21447.57089552239
[READ], 25900, 21008.705298013247
[READ], 26000, 23399.974729241876
[READ], 26100, 17362.089552238805
[READ], 26200, 28428.492537313432
[READ], 26300, 25190.34008097166
[READ], 26400, 13882.212435233161
[READ], 26500, 7681.543859649123
[READ], 26600, 12297.940397350992
[READ], 26700, 19429.22969837587
[READ], 26800, 19706.402985074626
[READ], 26900, 18277.2109375
[READ], 27000, 44891.70416666667
[READ], 27100, 21183.501992031874
[READ], 27200, 20347.959866220735
[READ], 27300, 22510.85714285714
[READ], 27400, 16519.200647249192
[READ], 27500, 11259.659259259259
[READ], 27600, 21696.088737201364
[READ], 27700, 19684.08653846154
[READ], 27800, 28525.438271604937
[READ], 27900, 16275.567765567766
[READ], 28000, 18833.18181818182
[READ], 28100, 21146.356902356903
[READ], 28200, 23593.416666666668
[READ], 28300, 20011.827242524916
[READ], 28400, 22063.06343283582
[READ], 28500, 22698.758992805757
[READ], 28600, 19067.096899224805
[READ], 28700, 21222.91447368421
[READ], 28800, 18789.73046875
[READ], 28900, 14843.548507462687
[READ], 29000, 24128.52857142857
[READ], 29100, 24068.3984063745
[READ], 29200, 21947.63725490196
[READ], 29300, 22432.82096069869
[READ], 29400, 13825.560371517027
[READ], 29500, 34002.16149068323
[READ], 29600, 22562.970954356846
[READ], 29700, 17911.65350877193
[READ], 29800, 35152.34309623431
[READ], 29900, 17767.16015625
[READ], 30000, 22322.25874125874
[READ], 30100, 22354.379182156135
[READ], 30200, 16407.513422818793
[READ], 30300, 20988.737991266375
[READ], 30400, 12528.621428571429
[READ], 30500, 9804.05693069307
[READ], 30600, 32941.18859649123
[READ], 30700, 19241.836909871243
[READ], 30800, 18268.003802281368
[READ], 30900, 20664.941605839416
[READ], 31000, 20097.63703703704
[READ], 31100, 5533.95
[READ], 31200, 34634.1
[READ], 31300, 37386.5
[READ], 31400, 15191.814432989691
[READ], 31500, 39356.31067961165
[READ], 31600, 26562.77966101695
[READ], 31700, 10689.782738095239
[READ], 31800, 12389.798816568047
[READ], 31900, 19659.253424657534
[READ], 32000, 21722.75420875421
[READ], 32100, 23361.417142857143
[READ], 32200, 9000.40072202166
[READ], 32300, 6121.002114164905
[READ], 32400, 4434.770226537217
[READ], 32500, 20172.247838616713
[READ], 32600, 16182.623003194889
[READ], 32700, 18787.93924050633
[READ], 32800, 25838.4046692607
[READ], 32900, 38819.222627737225
[READ], 33000, 20177.526119402984
[READ], 33100, 21462.557620817843
[READ], 33200, 22451.743902439026
[READ], 33300, 21344.52475247525
[READ], 33400, 20849.522058823528
[READ], 33500, 21475.41584158416
[READ], 33600, 9841.91489361702
[READ], 33700, 14948.393822393822
[READ], 33800, 36267.32191780822
[READ], 33900, 13125.506437768241
[READ], 34000, 10427.092105263158
[READ], 34100, 28130.24
[READ], 34200, 29895.535714285714
[READ], 34300, 12969.216
[READ], 34400, 33423.48198198198
[READ], 34500, 22355.302681992336
[READ], 34600, 21302.072
[READ], 34700, 21842.829365079364
[READ], 34800, 17136.06746031746
[READ], 34900, 23942.55438596491
[READ], 35000, 21966.12017167382
[READ], 35100, 20358.597972972973
[READ], 35200, 22225.458646616542
[READ], 35300, 9332.38655462185
[READ], 35400, 21774.91737891738
[READ], 35500, 12731.515942028986
[READ], 35600, 24364.578125
[READ], 35700, 6353.332116788321
[READ], 35800, 10274.051181102363
[READ], 35900, 20730.073913043478
[READ], 36000, 39303.26254826255
[READ], 36100, 13742.890151515152
[READ], 36200, 37267.92946058091
[READ], 36300, 31935.837438423645
[READ], 36400, 26349.51101321586
[READ], 36500, 6945.976744186047
[READ], 36600, 11643.602459016394
[READ], 36700, 16243.375609756098
[READ], 36800, 19840.876254180603
[READ], 36900, 46729.538775510206
[READ], 37000, 25825.131034482758
[READ], 37100, 14504.640776699029
[READ], 37200, 18150.64642857143
[READ], 37300, 24945.355648535566
[READ], 37400, 28460.52608695652
[READ], 37500, 17947.4598540146
[READ], 37600, 18688.141732283464
[READ], 37700, 27656.46332046332
[READ], 37800, 18173.11076923077
[READ], 37900, 6342.514705882353
[READ], 38000, 13165.632183908046
[READ], 38100, 20272.10355987055
[READ], 38200, 20693.003095975233
[READ], 38300, 32655.78523489933
[READ], 38400, 13757.271241830065
[READ], 38500, 11335.25
[READ], 38600, 32139.157142857144
[READ], 38700, 12079.609756097561
[READ], 38800, 12633.80149812734
[READ], 38900, 12006.897610921502
[READ], 39000, 18941.275555555556
[READ], 39100, 13731.111445783132
[READ], 39200, 48016.03378378379
[READ], 39300, 32926.43493150685
[READ], 39400, 15963.150684931506
[READ], 39500, 26446.806691449816
[READ], 39600, 10203.483076923078
[READ], 39700, 20379.65737051793
[READ], 39800, 28422.776556776556
[READ], 39900, 26253.151750972764
[READ], 40000, 25326.542857142857
[READ], 40100, 24447.109090909093
[READ], 40200, 18442.87037037037
[READ], 40300, 10315.218390804597
[READ], 40400, 20823.15309446254
[READ], 40500, 9905.275109170305
[READ], 40600, 19005.505415162454
[READ], 40700, 20836.37037037037
[READ], 40800, 25118.589655172414
[READ], 40900, 35276.75833333333
[READ], 41000, 12480.18661971831
[READ], 41100, 6977.205882352941
[READ], 41200, 13261.149006622516
[READ], 41300, 32167.402489626555
[READ], 41400, 27975.138059701494
[READ], 41500, 21517.420382165605
[READ], 41600, 20811.141342756182
[READ], 41700, 10169.985074626866
[READ], 41800, 12012.191588785046
[READ], 41900, 12625.98
[READ], 42000, 15276.61596958175
[READ], 42100, 29835.16738197425
[READ], 42200, 27682.389105058366
[READ], 42300, 23938.047826086957
[READ], 42400, 23208.72340425532
[READ], 42500, 30579.404858299597
[READ], 42600, 24816.48632218845
[READ], 42700, 19897.762057877815
[READ], 42800, 21863.98084291188
[READ], 42900, 13970.109649122807
[READ], 43000, 18267.687969924813
[READ], 43100, 15859.094339622641
[READ], 43200, 22520.865546218487
[READ], 43300, 20050.672839506173
[READ], 43400, 18895.313531353135
[READ], 43500, 23018.71851851852
[READ], 43600, 8286.074074074075
[READ], 43700, 9975.628070175439
[READ], 43800, 31330.840136054423
[READ], 43900, 13229.495798319327
[READ], 44000, 28274.384615384617
[READ], 44100, 13691.876325088338
[READ], 44200, 30248.646616541355
[READ], 44300, 21009.791338582676
[READ], 44400, 7209.677740863787
[READ], 44500, 11653.074074074075
[READ], 44600, 12921.679054054053
[READ], 44700, 27231.87545787546
[READ], 44800, 12776.033834586466
[READ], 44900, 17018.063380281692
[READ], 45000, 15904.47
[READ], 45100, 22243.1875
[READ], 45200, 23301.2625
[READ], 45300, 2742.622905027933
[READ], 45400, 3966.391489361702
[READ], 45500, 54520.57272727273
[READ], 45600, 7956.940425531915
[READ], 45700, 3373.4421487603304
[READ], 45800, 12292.136531365313
[READ], 45900, 51204.49173553719
[READ], 46000, 24177.711934156378
[READ], 46100, 30152.8
[READ], 46200, 9490.958801498127
[READ], 46300, 13980.378746594006
[READ], 46400, 15522.733333333334
[READ], 46500, 30161.755555555555
[READ], 46600, 11676.422924901186
[READ], 46700, 39009.626126126124
[READ], 46800, 9669.647368421052
[READ], 46900, 13803.826530612245
[READ], 47000, 15821.114551083592
[READ], 47100, 16326.466666666667
[READ], 47200, 13114.250883392226
[READ], 47300, 15880.320463320464
[READ], 47400, 16191.460317460318
[READ], 47500, 18141.9889298893
[READ], 47600, 21264.86434108527
[READ], 47700, 13834.11155378486
[READ], 47800, 23026.875555555554
[READ], 47900, 49632.637305699485
[READ], 48000, 16680.44230769231
[READ], 48100, 10495.438735177866
[READ], 48200, 7763.98
[READ], 48300, 9158.022123893805
[READ], 48400, 9546.104712041884
[READ], 48500, 14062.71891891892
[READ], 48600, 21152.20945945946
[READ], 48700, 8706.5
[READ], 48800, 8005.91095890411
[READ], 48900, 6217.583333333333
[READ], 49000, 5548.31746031746
[READ], 49100, 4457.872340425532
[READ], 49200, 4136.688172043011
[READ], 49300, 2189.699481865285
[READ], 49400, 1188.0916666666667
[READ], 49500, 1187.8095238095239
[READ], 49700, 16782.018633540374
[READ], 49800, 22738.42084942085
[READ], 49900, 21168.24907063197
[READ], 50000, 20782.919708029196
[READ], 50100, 20469.22265625
[READ], 50200, 20069.362369337978
[READ], 50300, 22936.0
[READ], 50400, 15299.91489361702
[READ], 50500, 18571.852713178294
[READ], 50600, 23932.75
[READ], 50700, 19511.53982300885
[READ], 50800, 19366.67302452316
[READ], 50900, 20725.355481727576
[READ], 51000, 14442.388888888889
[READ], 51100, 25169.289115646257
[READ], 51200, 22839.687747035572
[READ], 51300, 20490.725274725275
[READ], 51400, 8157.860103626943
[READ], 51500, 9435.726342710997
[READ], 51600, 24452.993174061434
[READ], 51700, 16101.41568627451
[READ], 51800, 29711.75912408759
[READ], 51900, 26422.016194331984
[READ], 52000, 22084.49411764706
[READ], 52100, 21167.56106870229
[READ], 52200, 21388.279569892475
[READ], 52300, 7945.394736842105
[READ], 52400, 17792.72972972973
[READ], 52500, 11816.804195804196
[READ], 52600, 25415.677536231884
[READ], 52700, 25770.69512195122
[READ], 52800, 11430.259868421053
[READ], 52900, 15164.111464968153
[READ], 53000, 5326.691176470588
[READ], 53100, 51656.577235772354
[READ], 53200, 5661.05585106383
[READ], 53300, 10678.738955823294
[READ], 53400, 22833.866379310344
[READ], 53500, 29157.012931034482
[READ], 53600, 11284.925925925925
[READ], 53700, 17481.380116959066
[READ], 53800, 15979.880434782608
[READ], 53900, 20383.875
[READ], 54000, 12507.349775784753
[READ], 54100, 10065.338521400778
[READ], 54200, 21241.146706586827
[READ], 54300, 39244.68387096774
[READ], 54400, 29566.189003436426
[READ], 54500, 17336.44481605351
[READ], 54600, 14949.383763837639
[READ], 54700, 25610.67527675277
[READ], 54800, 14455.24
[READ], 54900, 22946.580536912752
[READ], 55000, 23538.521126760563
[READ], 55100, 21475.533864541834
[READ], 55200, 8147.209567198178
[READ], 55300, 25649.709219858156
[READ], 55400, 14200.970802919708
[READ], 55500, 20428.573446327682
[READ], 55600, 17524.838187702266
[READ], 55700, 10478.714285714286
[READ], 55800, 24053.843971631206
[READ], 55900, 40165.25925925926
[READ], 56000, 7394.857627118644
[READ], 56100, 10787.935897435897
[READ], 56200, 13834.936802973978
[READ], 56300, 19669.155555555557
[READ], 56400, 12102.953781512606
[READ], 56500, 41594.24888888889
[READ], 56600, 44440.793103448275
[READ], 56700, 6153.528089887641
[READ], 56800, 6507.547263681592
[READ], 56900, 30282.276276276276
[READ], 57000, 13143.553956834532
[READ], 57100, 17889.899390243903
[READ], 57200, 22377.552845528455
[READ], 57300, 18765.74613003096
[READ], 57400, 15728.963855421687
[READ], 57500, 23369.897058823528
[READ], 57600, 19831.894736842107
[READ], 57700, 20031.938053097347
[READ], 57800, 14725.92664092664
[READ], 57900, 72559.90434782609
[READ], 58000, 222031.0
[CLEANUP], Operations, 60
[CLEANUP], AverageLatency(us), 304.1666666666667
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 18233
[CLEANUP], 0, 0.23636363636363636
[CLEANUP], 100, 1.0
[CLEANUP], 200, 18233.0
[UPDATE], Operations, 1638
[UPDATE], AverageLatency(us), 247999.00427350428
[UPDATE], MinLatency(us), 4729
[UPDATE], MaxLatency(us), 2382225
[UPDATE], Return=OK, 1638
[UPDATE], 0, 204401.2
[UPDATE], 100, 38431.42857142857
[UPDATE], 200, 79119.66666666667
[UPDATE], 300, 24211.875
[UPDATE], 400, 27685.833333333332
[UPDATE], 600, 13942.0
[UPDATE], 700, 47351.42857142857
[UPDATE], 800, 21908.2
[UPDATE], 1000, 101323.375
[UPDATE], 1100, 26195.076923076922
[UPDATE], 1200, 40940.2
[UPDATE], 1300, 26468.666666666668
[UPDATE], 1400, 14004.6
[UPDATE], 1500, 18572.0
[UPDATE], 1600, 65735.0
[UPDATE], 1700, 117954.25
[UPDATE], 1800, 77888.5
[UPDATE], 1900, 91525.66666666667
[UPDATE], 2000, 87976.5
[UPDATE], 2100, 101860.5
[UPDATE], 2200, 160816.8
[UPDATE], 2300, 59285.0
[UPDATE], 2400, 125379.0
[UPDATE], 2500, 82461.5
[UPDATE], 2600, 97648.8
[UPDATE], 2700, 71422.33333333333
[UPDATE], 2800, 76756.0
[UPDATE], 3000, 101710.0
[UPDATE], 3100, 86306.33333333333
[UPDATE], 3200, 167724.0
[UPDATE], 3300, 137552.4
[UPDATE], 3500, 213111.66666666666
[UPDATE], 3700, 313729.2
[UPDATE], 3800, 180907.5
[UPDATE], 3900, 339779.0
[UPDATE], 4000, 263840.0
[UPDATE], 4100, 268634.0
[UPDATE], 4200, 132593.0
[UPDATE], 4300, 120490.0
[UPDATE], 4400, 99294.0
[UPDATE], 4500, 123923.0
[UPDATE], 4600, 75517.33333333333
[UPDATE], 4700, 73539.0
[UPDATE], 4800, 131617.75
[UPDATE], 4900, 107828.0
[UPDATE], 5000, 67130.5
[UPDATE], 5100, 92091.66666666667
[UPDATE], 5200, 113962.66666666667
[UPDATE], 5400, 98316.66666666667
[UPDATE], 5600, 120322.75
[UPDATE], 5800, 259415.0
[UPDATE], 5900, 288595.0
[UPDATE], 6200, 332038.2
[UPDATE], 6300, 175629.0
[UPDATE], 6400, 912803.0
[UPDATE], 6500, 321231.1666666667
[UPDATE], 6700, 211550.0909090909
[UPDATE], 6900, 148758.125
[UPDATE], 7100, 123279.28571428571
[UPDATE], 7300, 215066.75
[UPDATE], 7400, 120935.83333333333
[UPDATE], 7600, 53928.0
[UPDATE], 7900, 227338.7142857143
[UPDATE], 8000, 202127.75
[UPDATE], 8100, 158197.33333333334
[UPDATE], 8200, 272098.3333333333
[UPDATE], 8300, 315794.6666666667
[UPDATE], 8400, 61433.0
[UPDATE], 8600, 111197.0
[UPDATE], 8700, 102569.0
[UPDATE], 8800, 141802.0
[UPDATE], 8900, 102652.66666666667
[UPDATE], 9100, 263160.0
[UPDATE], 9200, 222338.0
[UPDATE], 9300, 200181.0
[UPDATE], 9400, 219123.75
[UPDATE], 9500, 202893.0
[UPDATE], 9600, 107552.0
[UPDATE], 9700, 199528.0
[UPDATE], 9800, 237126.0
[UPDATE], 9900, 199451.75
[UPDATE], 10000, 107454.2
[UPDATE], 10100, 95197.33333333333
[UPDATE], 10200, 62279.0
[UPDATE], 10400, 181342.0
[UPDATE], 10500, 125675.5
[UPDATE], 10600, 245419.0
[UPDATE], 10800, 443529.0
[UPDATE], 10900, 497864.0
[UPDATE], 11000, 374550.36363636365
[UPDATE], 11100, 241582.0
[UPDATE], 11200, 246878.33333333334
[UPDATE], 11300, 115367.5
[UPDATE], 11400, 110761.0
[UPDATE], 11500, 68967.5
[UPDATE], 11600, 113355.0
[UPDATE], 11700, 70338.5
[UPDATE], 11800, 119999.0
[UPDATE], 11900, 178463.0
[UPDATE], 12100, 157916.6
[UPDATE], 12300, 146219.4
[UPDATE], 12400, 161647.33333333334
[UPDATE], 12500, 131216.66666666666
[UPDATE], 12600, 198008.66666666666
[UPDATE], 12700, 109003.0
[UPDATE], 12800, 113566.0
[UPDATE], 12900, 83805.0
[UPDATE], 13000, 176175.5
[UPDATE], 13100, 167551.4
[UPDATE], 13200, 113585.66666666667
[UPDATE], 13400, 220366.0
[UPDATE], 13500, 195416.375
[UPDATE], 13600, 100078.33333333333
[UPDATE], 13700, 153895.0
[UPDATE], 13800, 146234.33333333334
[UPDATE], 13900, 95302.5
[UPDATE], 14000, 95668.0
[UPDATE], 14100, 77157.66666666667
[UPDATE], 14200, 66550.0
[UPDATE], 14400, 175979.2
[UPDATE], 14500, 98905.0
[UPDATE], 15100, 387206.5
[UPDATE], 15200, 394143.6
[UPDATE], 15300, 453119.28571428574
[UPDATE], 15400, 223716.85714285713
[UPDATE], 15500, 146561.8
[UPDATE], 15600, 121102.8
[UPDATE], 15700, 85035.0
[UPDATE], 15800, 107869.5
[UPDATE], 15900, 119352.16666666667
[UPDATE], 16000, 110485.66666666667
[UPDATE], 16100, 157685.33333333334
[UPDATE], 16300, 244178.5
[UPDATE], 16500, 152070.0
[UPDATE], 16600, 194410.0
[UPDATE], 16700, 137674.0
[UPDATE], 16800, 161874.16666666666
[UPDATE], 17000, 331371.6
[UPDATE], 17100, 146160.8
[UPDATE], 17300, 165286.0
[UPDATE], 17400, 209881.5
[UPDATE], 17500, 225054.4
[UPDATE], 17600, 119040.5
[UPDATE], 17700, 75578.0
[UPDATE], 17800, 112034.0
[UPDATE], 18000, 155751.25
[UPDATE], 18100, 99898.25
[UPDATE], 18200, 110223.0
[UPDATE], 18300, 101618.0
[UPDATE], 18700, 336572.75
[UPDATE], 18800, 195181.0
[UPDATE], 18900, 117069.25
[UPDATE], 19000, 143859.5
[UPDATE], 19200, 73607.33333333333
[UPDATE], 19600, 233096.57142857142
[UPDATE], 19700, 168739.5
[UPDATE], 19800, 148107.0
[UPDATE], 19900, 108304.66666666667
[UPDATE], 20000, 108231.5
[UPDATE], 20100, 102600.0
[UPDATE], 20200, 103004.0
[UPDATE], 20300, 83131.75
[UPDATE], 20400, 117875.5
[UPDATE], 20600, 139419.0
[UPDATE], 20800, 90437.33333333333
[UPDATE], 20900, 610379.0
[UPDATE], 21000, 71119.0
[UPDATE], 21100, 88375.2
[UPDATE], 21200, 125271.0
[UPDATE], 21400, 213543.0
[UPDATE], 21500, 170020.8
[UPDATE], 21600, 108400.33333333333
[UPDATE], 21700, 103337.4
[UPDATE], 21800, 121343.25
[UPDATE], 21900, 85878.0
[UPDATE], 22000, 114478.0
[UPDATE], 22100, 90453.0
[UPDATE], 22200, 69315.5
[UPDATE], 22300, 144477.5
[UPDATE], 22500, 123772.25
[UPDATE], 22600, 433427.5
[UPDATE], 22700, 139797.2
[UPDATE], 22800, 117995.0
[UPDATE], 22900, 92475.125
[UPDATE], 23000, 83597.0
[UPDATE], 23100, 79150.8
[UPDATE], 23200, 72689.0
[UPDATE], 23300, 102734.5
[UPDATE], 23600, 190680.0
[UPDATE], 23800, 113894.6
[UPDATE], 23900, 158426.0
[UPDATE], 24000, 138512.0
[UPDATE], 24100, 147441.0
[UPDATE], 24200, 174465.0
[UPDATE], 24300, 151741.14285714287
[UPDATE], 24600, 277747.3333333333
[UPDATE], 24700, 285275.0
[UPDATE], 25000, 491738.0
[UPDATE], 25100, 374736.75
[UPDATE], 25200, 151778.75
[UPDATE], 25500, 196018.33333333334
[UPDATE], 25600, 120017.0
[UPDATE], 25700, 135290.6
[UPDATE], 25800, 139566.0
[UPDATE], 25900, 141163.8
[UPDATE], 26000, 130463.83333333333
[UPDATE], 26500, 233193.625
[UPDATE], 26600, 141578.0
[UPDATE], 26700, 120522.0
[UPDATE], 26800, 90190.0
[UPDATE], 26900, 120852.0
[UPDATE], 27000, 69039.5
[UPDATE], 27400, 431706.0
[UPDATE], 27500, 260533.23076923078
[UPDATE], 27600, 159729.5
[UPDATE], 27700, 185358.8
[UPDATE], 27800, 148123.0
[UPDATE], 27900, 145534.33333333334
[UPDATE], 28000, 73142.0
[UPDATE], 28100, 106294.5
[UPDATE], 28200, 96566.33333333333
[UPDATE], 28300, 111434.66666666667
[UPDATE], 28400, 190278.0
[UPDATE], 28500, 147725.66666666666
[UPDATE], 28600, 127262.33333333333
[UPDATE], 28800, 211369.2
[UPDATE], 28900, 149910.8
[UPDATE], 29100, 156256.57142857142
[UPDATE], 29200, 149539.0
[UPDATE], 29300, 95556.0
[UPDATE], 29400, 149769.5
[UPDATE], 29500, 201739.0
[UPDATE], 29600, 135403.0
[UPDATE], 29700, 103498.66666666667
[UPDATE], 29900, 149336.0
[UPDATE], 30000, 247106.2857142857
[UPDATE], 30100, 142544.5
[UPDATE], 30300, 219302.0
[UPDATE], 30400, 191960.33333333334
[UPDATE], 30500, 167824.5
[UPDATE], 30600, 158404.0
[UPDATE], 30800, 239076.0
[UPDATE], 30900, 248447.0
[UPDATE], 31200, 219087.25
[UPDATE], 31300, 141611.5
[UPDATE], 31800, 608903.0
[UPDATE], 31900, 342942.2
[UPDATE], 32000, 190985.25
[UPDATE], 32100, 284221.71428571426
[UPDATE], 32300, 178228.25
[UPDATE], 32400, 383168.0
[UPDATE], 32500, 62735.5
[UPDATE], 32600, 65730.5
[UPDATE], 32700, 102735.5
[UPDATE], 32800, 94632.0
[UPDATE], 33000, 93842.66666666667
[UPDATE], 33100, 90266.5
[UPDATE], 33200, 71405.5
[UPDATE], 33500, 304939.0
[UPDATE], 33600, 356905.3333333333
[UPDATE], 33900, 325027.0
[UPDATE], 34000, 229115.0
[UPDATE], 34200, 265302.71428571426
[UPDATE], 34300, 142064.25
[UPDATE], 34400, 126066.5
[UPDATE], 34500, 162097.0
[UPDATE], 34600, 148555.0
[UPDATE], 34700, 122609.5
[UPDATE], 34800, 68795.0
[UPDATE], 34900, 67289.0
[UPDATE], 35000, 92445.66666666667
[UPDATE], 35100, 103066.0
[UPDATE], 35200, 140041.5
[UPDATE], 35300, 140760.25
[UPDATE], 35400, 86624.0
[UPDATE], 35500, 28304.5
[UPDATE], 35600, 234093.0
[UPDATE], 35700, 67312.5
[UPDATE], 35900, 328540.0
[UPDATE], 36000, 410786.6666666667
[UPDATE], 36100, 192792.5
[UPDATE], 36200, 352073.0
[UPDATE], 36300, 615911.0
[UPDATE], 36400, 565916.0
[UPDATE], 36600, 552292.6666666666
[UPDATE], 36700, 417732.0
[UPDATE], 36800, 421621.1666666667
[UPDATE], 36900, 230020.0
[UPDATE], 37000, 179808.66666666666
[UPDATE], 37100, 124774.4
[UPDATE], 37300, 139381.66666666666
[UPDATE], 37400, 106813.0
[UPDATE], 37500, 143911.75
[UPDATE], 37600, 165594.0
[UPDATE], 37700, 137313.5
[UPDATE], 37800, 119023.5
[UPDATE], 38000, 176572.14285714287
[UPDATE], 38400, 41664.5
[UPDATE], 38500, 437039.0
[UPDATE], 38700, 256327.18181818182
[UPDATE], 38800, 198265.0
[UPDATE], 38900, 212748.33333333334
[UPDATE], 39000, 139871.66666666666
[UPDATE], 39100, 129873.5
[UPDATE], 39300, 78574.0
[UPDATE], 39400, 289628.0
[UPDATE], 39500, 148819.0
[UPDATE], 39600, 119142.0
[UPDATE], 39700, 129700.0
[UPDATE], 40100, 250696.85714285713
[UPDATE], 40300, 161130.75
[UPDATE], 40400, 221409.0
[UPDATE], 40500, 131469.66666666666
[UPDATE], 40600, 178571.5
[UPDATE], 41000, 557251.2
[UPDATE], 41100, 335864.8
[UPDATE], 41200, 176753.33333333334
[UPDATE], 41300, 227337.5
[UPDATE], 41400, 175155.33333333334
[UPDATE], 41500, 133784.375
[UPDATE], 41600, 86246.0
[UPDATE], 41800, 103863.28571428571
[UPDATE], 42100, 410618.14285714284
[UPDATE], 42200, 138682.0
[UPDATE], 42300, 136844.2857142857
[UPDATE], 42400, 108075.0
[UPDATE], 42500, 94110.5
[UPDATE], 43200, 562438.1111111111
[UPDATE], 43300, 299187.14285714284
[UPDATE], 43500, 213117.33333333334
[UPDATE], 43600, 172577.2
[UPDATE], 43800, 212425.5
[UPDATE], 44000, 263822.85714285716
[UPDATE], 44200, 301987.0
[UPDATE], 44800, 798023.625
[UPDATE], 44900, 632803.8333333334
[UPDATE], 45000, 349597.85714285716
[UPDATE], 45100, 334530.0
[UPDATE], 45300, 456165.6
[UPDATE], 45500, 494972.5
[UPDATE], 45600, 309896.14285714284
[UPDATE], 45700, 242240.75
[UPDATE], 45800, 108853.16666666667
[UPDATE], 46300, 555221.0
[UPDATE], 46500, 450739.0625
[UPDATE], 46700, 333928.5714285714
[UPDATE], 46800, 260849.5
[UPDATE], 46900, 50206.5
[UPDATE], 49300, 1458436.8666666667
[UPDATE], 49500, 101597.25
[UPDATE], 49600, 122392.5
[UPDATE], 49700, 98302.2
[UPDATE], 49800, 100980.66666666667
[UPDATE], 50000, 100404.0
[UPDATE], 50100, 136978.2
[UPDATE], 50200, 206397.0
[UPDATE], 50300, 198739.0
[UPDATE], 50400, 114872.33333333333
[UPDATE], 50500, 105575.8
[UPDATE], 50700, 263544.0
[UPDATE], 50800, 185027.0
[UPDATE], 50900, 126858.0
[UPDATE], 51200, 215205.0
[UPDATE], 51300, 296217.0
[UPDATE], 51400, 262777.6
[UPDATE], 51500, 170817.0
[UPDATE], 51600, 96490.8
[UPDATE], 51700, 94557.57142857143
[UPDATE], 51800, 98197.0
[UPDATE], 51900, 118286.0
[UPDATE], 52300, 465645.0
[UPDATE], 52600, 419545.375
[UPDATE], 52700, 579643.0
[UPDATE], 52800, 420312.0
[UPDATE], 53100, 479377.8
[UPDATE], 53200, 538330.0
[UPDATE], 53400, 581416.6666666666
[UPDATE], 53500, 519751.6666666667
[UPDATE], 53700, 322507.7
[UPDATE], 53800, 125292.33333333333
[UPDATE], 53900, 165575.5
[UPDATE], 54000, 182355.0
[UPDATE], 54100, 133633.0
[UPDATE], 54300, 164102.4
[UPDATE], 54400, 211450.0
[UPDATE], 54500, 139452.6
[UPDATE], 54700, 91497.0
[UPDATE], 54900, 178651.0
[UPDATE], 55000, 136324.25
[UPDATE], 55100, 143762.11111111112
[UPDATE], 55200, 96280.66666666667
[UPDATE], 55500, 148224.75
[UPDATE], 56300, 535071.4615384615
[UPDATE], 56400, 550774.5555555555
[UPDATE], 56500, 977497.0
[UPDATE], 56600, 267782.25
[UPDATE], 56700, 196818.2857142857
[UPDATE], 56800, 157846.0
[UPDATE], 56900, 83285.8
[UPDATE], 57000, 118055.0
[UPDATE], 57100, 132917.0
[UPDATE], 57200, 110460.0
[UPDATE], 57400, 123400.66666666667
[UPDATE], 57600, 191523.25
[UPDATE], 57700, 319219.0